src/cf/Catalogs/Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Процессы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.БизнесЦели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлементПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭлементыПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяИстория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользовательскиеИстории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Персона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ЭлементыПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ЭлементыПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПользовательскаяИстория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВариантУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комментарий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Процессы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОпределитьСлой();
	ЗаполнитьВспомогательныеРеквизиты();
КонецПроцедуры

&НаСервере
Процедура ОпределитьСлой()
	Слои = Новый Массив;
	
	Слои.Добавить("Слой_Комментарий");
	Слои.Добавить("Слой_ВложенныйПроцесс");
	Слои.Добавить("Слой_ВариантУсловия");
	Слои.Добавить("Слой_Условие");
	Слои.Добавить("Слой_ПользовательскаяИстория");
	Слои.Добавить("Слой_Завершение");
	Слои.Добавить("Слой_Старт");
	
	Для Каждого Слой Из Слои Цикл
		ИмяЭлементаПроцесса = СтрЗаменить(Слой, "Слой_", "");
		
		Элементы[Слой].Видимость = Перечисления.ЭлементыПроцесса[ИмяЭлементаПроцесса] = Объект.ЭлементПроцесса;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВспомогательныеРеквизиты()
	Персона = Объект.Персона;
	КлючевоеДействие = Объект.ПользовательскаяИстория.КлючевоеДействие;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ПользовательскаяИстория Тогда
		ДанныеПользовательскойИстории = Новый Структура;
		
		ДанныеПользовательскойИстории.Вставить("Персона", Объект.Персона);
		ДанныеПользовательскойИстории.Вставить("КлючевоеДействие", КлючевоеДействие);
		ДанныеПользовательскойИстории.Вставить("Владелец", Объект.Владелец);
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеПользовательскойИстории", ДанныеПользовательскойИстории);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("УстановитьКурсорНаНовыйЭлементПроцесса", Объект.Ссылка);
КонецПроцедуры
